# После игры в кубики Костя захотел немного изучить работу игровых автоматов,
# а заодно математику и теорию вероятностей. Но ему нужно с чего-то начать:
# написать программу, которая поможет выявить закономерности в комбинациях
# чисел на автомате.
#
# Даны три целых числа. Определите, сколько среди них совпадающих.
# Программа должна вывести одно из чисел: 3 (если все совпадают),
# 2 (если два совпадает) или 0 (если все числа различны).
a = int(input('Первое число: '))
b = int(input('Второе число: '))
c = int(input('Третье число: '))
if a == b == c:
  print(3)
elif a != b and a != c and b != c:
  print(0)
else:
  print(2)