# Напишите программу, которая выводит в отдельную строчку каждый
# символ фразы “Python!”.
for symbol in 'Python!':
    print(symbol)