#  Поиск элемента
#
# Когда мы работаем с большой многоуровневой структурой, нам нередко необходимо пройтись по ней и найти нужный элемент.
# #  Для этого в программировании используются специальные алгоритмы поиска.
#
# Напишите функцию, которая находит заданный пользователем ключ в словаре и выдаёт значение этого ключа на экран.
#  В качестве примера можно использовать такой словарь:

site = {
    'html': {
        'head': {
            'title': 'Мой сайт'
        },
        'body': {
            'h2': 'Здесь будет мой заголовок',
            'div': 'Тут, наверное, какой-то блок',
            'p': 'А вот здесь новый абзац'
        }
    }
}
# Пример 1:
# Искомый ключ: h2
# Значение: Здесь будет мой заголовок
#
# Пример 2:
# Искомый ключ: abc
#
# Такого ключа в структуре сайта нет.
def find_key(key_string, site):
    if key_string in site:
        return site[key_string]

    for sub_key in site.values():
        if isinstance(sub_key, dict):
            result = find_key(key_string, sub_key)
            if result:
                break
    else:
        result = None
    return result

key_string = input('Искомый ключ: ')
value = find_key(key_string, site)

if value:
    print('Значение:', value)
else:
    print('Такого ключа в структуре сайта нет.')