# Все мы знаем эту пословицу. И мы также знаем, что пренебрегать ей
# не стоит, особенно когда сдаёшь какой-нибудь крупный проект заказчику.
#
# Напишите программу, которая выводит сообщения о том, сколько раз мы
# уже отмерили (начиная с нуля) и в конце пишет “Отрезаем!”.
#
# Пример:
# Отмерили раз: 0
# Отмерили раз: 1
# Отмерили раз: 2
# Отмерили раз: 3
# Отмерили раз: 4
# Отмерили раз: 5
# Отмерили раз: 6
# Отмерили раз: 7
# Отрезаем!
for num in 0, 1, 2, 3, 4, 5, 6, 7:
    print('Отмерили раз:', num)
print('Отрезаем!')