# Напишите программу, которая выводит квадраты чисел от 0 до 10.
# Для этого используйте цикл for и функцию range.
for i in range(11):
    print(i ** 2)
